Revit 2027 API
StructuralSectionRound.Diameter Property
 Pipe Diameter.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Diameter { get; set; }
Public Property Diameter As Double
	Get
	Set
public:
property double Diameter {
	double get ();
	void set (double value);
}
member Diameter : float with get, set
Property Value
Double
See Also
Reference
StructuralSectionRound Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace